const CharacterData = {
  // 남성 캐릭터 부문
  "male": {
    "2026년 1분기": {
      "101":[
      { id: 1, name: "세로(セロ)", cv: "토키 슌이치(土岐隼一)", img: "" },
      { id: 2, name: "시우(シウ)", cv: "테라시마 타쿠마(寺島拓篤)", img: "" },
      { id: 3, name: "미케(ミケ)", cv: "나가츠카 타쿠마(永塚拓馬)", img: "" },
      { id: 4, name: "미케(ミケ)", cv: "나가츠카 타쿠마(永塚拓馬)", img: "" },
      { id: 5, name: "휴(ヒュー)", cv: "아자카미 요헤이(阿座上洋平)", img: "" },
      { id: 6, name: "헤라(ヘラ)", cv: "타니야마 키쇼(谷山紀章)", img: "" },
      { id: 7, name: "노에(ノエ)", cv: "야스다 리쿠야(安田陸矢)", img: "" },
      { id: 8, name: "레우(レウ)", cv: "유우키 코즈에(結木梢)", img: "" },
      { id: 9, name: "레우(レウ)", cv: "유우키 코즈에(結木梢)", img: "" },
      { id: 10, name: "네로(ネロ)", cv: "하토리 사츠키(羽鳥颯希)", img: "" },
      { id: 11, name: "벨타(ベルタ)", cv: "야마모토 노조미(山本 希望)", img: "" },
      { id: 12, name: "폰(フォン)", cv: "오오노 토모히로(大野智敬)", img: "" }
      ],
      "102":[
      { id: 1, name: "하이마와리 코이치(灰廻航一)", cv: "우메다 슈이치로(梅田修一朗)", img: "" },
      { id: 2, name: "하네야마 카즈호(羽根山和歩)", cv: "하세가와 이쿠미(長谷川育美)", img: "" },
      { id: 3, name: "너클 더스터(ナックルダスター)", cv: "마미야 야스히로(間宮康弘)", img: "" },
      { id: 4, name: "올마이트(オールマイト)", cv: "미야케 켄타(三宅健太)", img: "" },
      { id: 5, name: "이레이저 헤드(イレイザー・ヘッド)", cv: "스와베 준이치(諏訪部順一)", img: "" },
      { id: 6, name: "프레젠트 마이크(プレゼント・マイク)", cv: "요시노 히로유키(吉野裕行)", img: "" },
      { id: 7, name: "미드나이트(ミッドナイト)", cv: "와타나베 아케노(渡辺明乃)", img: "" },
      { id: 8, name: "잉게니움(インゲニウム)", cv: "키타다 마사미치(北田理道)", img: "" },
      { id: 9, name: "캡틴 셀러브리티(キャプテンセレブリティ)", cv: "모리카와 토시유키(森川智之)", img: "" },
      { id: 10, name: "츠카우치 나오마사(塚内直正)", cv: "카와시마 토쿠요시(川島 得愛)", img: "" },
      { id: 11, name: "츠카우치 마코토(塚内誠)", cv: "세토 아사미(瀬戸麻沙美)", img: "" },
      { id: 12, name: "오구로 타마오(蜂須賀九印)", cv: "센본기 사야카(千本木彩花)", img: "" },
      { id: 13, name: "쿠기사키 소우가(釘崎爪牙)", cv: "토리우미 코스케(鳥海浩輔)", img: "" },
      { id: 14, name: "No.6", cv: "야시로 타쿠(八代 拓)", img: "" }
      ],
      "103":[
        { id : 1, name: "킨메 와카나(金目綿花奈)", cv: "스즈시로 사유미(鈴代紗弓)", img: "" },
        { id : 2, name: "이시모치 큐쇼(石持毬祥)", cv: "우메다 슈이치로(梅田修一朗)", img: "" },
        { id : 3, name: "카타구치 나이로(片口那色)", cv: "이나가키 코노미(稲垣 好)", img: "" },
        { id : 4, name: "와카스기 쿠리루(鰙 久里留)", cv: "아오야마 요시노(青山吉能)", img: "" },
        { id : 5, name: "와카스기 모루다(鰙 守大)", cv: "시라이시 켄토(白石兼斗)", img: "" },
        { id : 6, name: "야가라 아사미(矢柄麻未)", cv: "코시미즈 아미(小清水亜美)", img: "" },
        { id : 7, name: "아지(安治)", cv: "미즈타 와사비(水田 わさび)", img: "" },
        { id : 8, name: "이시모치 카시미(石持樫美)", cv: "히로하시 료(広橋 涼)", img: "" },
      ],
      104:[
        
      ],
    },
    "2026년 2분기": {
      "201"
    },
    "2026년 3분기": {
      "301"
    },
    "2026년 4분기": {
      "401"
    },
  },

  // 여성 캐릭터 부문
  "female": {
    "2024년 1분기": [
      {
        id: "c_f_24_1_01",
        animeId: "a_2024_1_10",
        name: "프리렌",
        cv: "타네자키 아츠미",
        img: "../images/char/f/frieren.jpg"
      }
    ],
    "2024년 2분기": [
      {
        id: "c_f_24_2_01",
        animeId: "a_2024_2_03",
        name: "야마다 안나",
        cv: "요미야 히나",
        img: "../images/char/f/yamada.jpg"
      }
    ],
    "2026년 3분기": [
      // 2분기 남자 캐릭터들...
    ],
    "2026년 4분기": [
      // 2분기 남자 캐릭터들...
    ]
  }
};